Конфигурация/Catalogs/Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Оповещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьСписокПолучателейИзИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Оповещения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ВидимостьДоступностьКорректность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураВложенийПисьмаВФорматеHTML = Неопределено Тогда
		СтруктураВложенийПисьмаВФорматеHTML = Новый Структура;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеКопирования) Тогда
		ЗагрузитьХранилищаЗначений(ЭтаФорма.Параметры.ЗначениеКопирования);
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтарыйТипСобытия = Объект.ТипСобытия;
	
	ЗагрузитьХранилищаЗначений(РеквизитФормыВЗначение("Объект"));
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХранилищаЗначений(Источник)
	
	Если Источник.ПисьмоВФорматеHTML Тогда
		
		ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML = Источник.КартинкиПисьмаВФорматеHTML.Получить();
		
		Если ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML = Неопределено Тогда
			ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML = Новый Структура;
		КонецЕсли;
		
		ЭтаФорма.ТекстПисьмаФорматированныйДокумент.УстановитьHTML(Источник.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
		
		ЭтаФорма.ОтображатьИсходныйКод = ИсходныйКодИзменен(ЭтаФорма.ТекстПисьмаФорматированныйДокумент, Источник.ТекстПисьмаВФорматеHTML);
		
	Иначе
		
		ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML = Новый Структура;
		ЭтаФорма.ОтображатьИсходныйКод				 = Ложь;
		
		ЭтаФорма.ТекстПисьмаФорматированныйДокумент.Удалить();
		ЭтаФорма.ТекстПисьмаФорматированныйДокумент.Добавить(Источник.Текст, ТипЭлементаФорматированногоДокумента.Текст);
		
	КонецЕсли;	
	
	Для Каждого ПараметрСобытия Из Источник.Параметры Цикл
		Массив = ПараметрСобытия.СписокЗначений.Получить();
		Если ТипЗнч(Массив) = Тип("Массив") Тогда
			Объект.Параметры[ПараметрСобытия.НомерСтроки - 1].СписокЗначенийДляФормы.ЗагрузитьЗначения(Массив);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.КартинкиПисьмаВФорматеHTML = Неопределено;
	
	Если ТекущийОбъект.ПисьмоВФорматеHTML Тогда
		
		Если ЭтаФорма.ОтображатьИсходныйКод Тогда
			ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
		КонецЕсли;
		
		ТекущийОбъект.Текст = СокрЛП(ТекстПисьмаФорматированныйДокумент.ПолучитьТекст());
		
		Если ЭтаФорма.ОтображатьИсходныйКод Тогда
			
			// Код берем как есть, интересуют только картинки
			
			ТекстПисьмаФорматированныйДокумент.ПолучитьHTML("", ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
			
		Иначе
			
			// В начале получаем текст HTML, каким он был внесен, и генерируем документ на его основе,
			// а сохраняем уже текст этого документа - так мы избавляемся от изменения текста
			
			ПервоначальныйТекстПисьмаВФорматеHTML = "";
			
			ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(ПервоначальныйТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
			ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ПервоначальныйТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
			ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
			
		КонецЕсли;
			
		Если ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML.Количество() > 0 Тогда
			ТекущийОбъект.КартинкиПисьмаВФорматеHTML = Новый ХранилищеЗначения(ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML, Новый СжатиеДанных(9));
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ПараметрСобытия Из Объект.Параметры Цикл
		ТекущийОбъект.Параметры[ПараметрСобытия.НомерСтроки - 1].СписокЗначений = Новый ХранилищеЗначения(ПараметрСобытия.СписокЗначенийДляФормы.ВыгрузитьЗначения());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСобытияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.ТипСобытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСобытийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыСобытий.ТекущиеДанные;
	Если ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидыСравнений.ВСписке")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидыСравнений.НеВСписке") Тогда
		
		Индекс = ТекущиеДанные.НомерСтроки - 1;

		Список = ОткрытьФормуМодально("Справочник.Оповещения.Форма.ФормаСпискаЗначений", Новый Структура("Список", ТекущиеДанные.СписокЗначенийДляФормы), ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
		Если Список <> Неопределено Тогда
			ТекущиеДанные.СписокЗначенийДляФормы.Очистить();
			ТекущиеДанные.СписокЗначенийДляФормы.ЗагрузитьЗначения(Список.ВыгрузитьЗначения());
			ТекущиеДанные.Значение = Строка(Список);
		КонецЕсли;	
		
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТипТекстаНаHTML(Команда)
	
	Объект.ПисьмоВФорматеHTML = Истина;
	
	ТекстПисьмаФорматированныйДокумент.Удалить();
	ТекстПисьмаФорматированныйДокумент.Добавить(Объект.Текст, ТипЭлементаФорматированногоДокумента.Текст);
	
	ТекущийЭлемент = Элементы.ТекстПисьмаФорматированныйДокумент;
	
	ВидимостьДоступностьКорректность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТипТекстаНаОбычный(Команда)
	
	Объект.ПисьмоВФорматеHTML = Ложь;
	
	Если ЭтаФорма.ОтображатьИсходныйКод Тогда
		ЗаполнитьТекстПисьмаФорматированныйДокументНаСервере(Объект.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
	КонецЕсли;
	
	ЭтаФорма.ОтображатьИсходныйКод = Ложь;
	
	Объект.ТекстПисьмаВФорматеHTML	= "";
	Объект.Текст					= СокрЛП(ТекстПисьмаФорматированныйДокумент.ПолучитьТекст());
	
	ТекущийЭлемент = Элементы.Текст;
	
	ВидимостьДоступностьКорректность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВключитьВыключитьОтображениеИсходногоКода(Команда)

	Если ЭтаФорма.ОтображатьИсходныйКод Тогда
		
		ЗаполнитьТекстПисьмаФорматированныйДокументНаСервере(Объект.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
		
		Если ИсходныйКодИзменен(ТекстПисьмаФорматированныйДокумент, Объект.ТекстПисьмаВФорматеHTML) Тогда
			Если Вопрос("Исходный код отредактирован. Изменения будут потеряны. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(Объект.ТекстПисьмаВФорматеHTML, ЭтаФорма.СтруктураВложенийПисьмаВФорматеHTML);
		
	КонецЕсли;
	
	ЭтаФорма.ОтображатьИсходныйКод = Не ЭтаФорма.ОтображатьИсходныйКод;

	ВидимостьДоступностьКорректность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьДоступностьКорректность(Форма)
	
	Объект		= Форма.Объект;
	Элементы	= Форма.Элементы;
	
	Элементы.ТекстПисьмаВФорматеHTML.Видимость					= Форма.ОтображатьИсходныйКод;
	Элементы.ТекстПисьмаФорматированныйДокумент.Видимость		= Не Форма.ОтображатьИсходныйКод;
	Элементы.ВключитьВыключитьОтображениеИсходногоКода.Пометка	= Форма.ОтображатьИсходныйКод;
	Элементы.КомандыРедактированияHTML.Доступность				= Не Форма.ОтображатьИсходныйКод;
	
	ПереключитьСтраницу(Элементы, "СтраницыТекстПисьма", ?(Объект.ПисьмоВФорматеHTML, "HTML", "ОбычныйТекст"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПереключитьСтраницу(Элементы, ИмяНабораСтраниц, СуффиксТекущейСтраницы)
	Элементы[ИмяНабораСтраниц].ТекущаяСтраница = Элементы[ИмяНабораСтраниц + СуффиксТекущейСтраницы];
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПисьмаФорматированныйДокументНаСервере(ТекстПисьмаВФорматеHTML, СтруктураВложенийПисьмаВФорматеHTML)
	
	ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ТекстПисьмаВФорматеHTML, СтруктураВложенийПисьмаВФорматеHTML);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИсходныйКодИзменен(ФорматированныйДокумент, ИсходныйКодHTML)

	ТекстHTML	= "";
	Вложения	= Новый Структура;
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	Возврат ИсходныйКодHTML <> ТекстHTML;
	
КонецФункции
